app/controllers/school_classes_controller.rb

UPDATE "school_classes" SET "title" = ?, "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "Org. Chemistry"], ["room_number", 505], ["updated_at", "2020-05-18 18:19:10.877796"], ["id", 1]]
---
    def update
        @school_class.update(school_class_params)