app/controllers/students_controller.rb

UPDATE "students" SET "school_class_id" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["school_class_id", 6], ["updated_at", "2020-05-18 18:59:34.912402"], ["id", 1]]
---
    def update
        @student.update(student_params)